In [1]:
!pip install faker
from faker import Faker
import pandas as pd

fake = Faker()

Requirement already satisfied: faker in c:\users\vishal\anaconda3\new folder\vishalda\vishaldaa\dataanalytics\lib\site-packages (37.1.0)
Requirement already satisfied: tzdata in c:\users\vishal\anaconda3\new folder\vishalda\vishaldaa\dataanalytics\lib\site-packages (from faker) (2023.3)

In [2]:
data = {
    'Name': [fake.name() for _ in range(100)],
    'Address': [fake.address() for _ in range(100)],
    'Date': [fake.date() for _ in range(100)]
}
df1 = pd.DataFrame(data)
df1.head()

,Name,Address,Date
0,Jason Foster,"608 Henry Keys Apt. 827\nWest Kendraberg, PR 0...",2014-01-29
1,Jose Nunez,"49020 Pruitt Pine\nPort Rose, NV 95659",2017-11-08
2,Melissa Vargas,"PSC 9250, Box 2113\nAPO AP 47930",2018-09-02
3,Robert Johnson,"507 Allen Forks\nHudsonchester, VT 27661",2004-12-30
4,Laura Jones,"3036 Martinez Springs\nSouth Tiffanymouth, TN ...",1986-05-19

In [3]:
names = [fake.name() for _ in range(20)]
df_names = pd.DataFrame({'Name': names})
df_names.head()

                 Name
0       Gary Gonzalez
1       Melissa Watts
2  Calvin Fletcher II
3       Antonio Young
4      Courtney Davis

In [4]:
emails = [fake.email() for _ in range(20)]
df_names['Email'] = emails
df_names.head()

                 Name                         Email
0       Gary Gonzalez        samantha48@example.net
1       Melissa Watts        karenstone@example.net
2  Calvin Fletcher II       carterjacob@example.org
3       Antonio Young  mcdonaldnicholas@example.net
4      Courtney Davis           wwright@example.com

In [5]:
dob = [fake.date_of_birth(minimum_age=18, maximum_age=60) for _ in range(20)]
df_names['DOB'] = dob
df_names['Age'] = [2025 - d.year for d in dob]
df_names.head()

                 Name                         Email         DOB  Age
0       Gary Gonzalez        samantha48@example.net  1969-07-29   56
1       Melissa Watts        karenstone@example.net  1975-12-20   50
2  Calvin Fletcher II       carterjacob@example.org  1979-03-29   46
3       Antonio Young  mcdonaldnicholas@example.net  1976-12-12   49
4      Courtney Davis           wwright@example.com  1971-08-18   54

In [6]:
products = {
    'Product_Name': [fake.word().capitalize() for _ in range(10)],
    'Price': [round(fake.random_number(digits=3), 2) for _ in range(10)]
}
df_products = pd.DataFrame(products)
df_products.head()

  Product_Name  Price
0         Once    628
1     Indicate     48
2       Toward    161
3      Quickly    171
4      Program    237

In [7]:
users = {
    'Name': [fake.name() for _ in range(10)],
    'City': [fake.city() for _ in range(10)],
    'Phone': [fake.phone_number() for _ in range(10)]
}
df_users = pd.DataFrame(users)
df_users.head()

              Name           City                Phone
0   April Reynolds   Kennedyburgh  +1-631-354-1699x536
1  Jasmine Edwards     Gomezmouth     464.370.8217x917
2     Kayla Mullen    Richardview         975-834-7261
3   Katherine Rice  Whiteheadtown   684-879-0499x63263
4   Rachael Wilson     Port Alice     739.620.6422x342

In [8]:
#16: Merging DataFrames 
# First DataFrame: Products
df_products = pd.DataFrame({
    'Product_ID': [101, 102, 103, 104, 105],
    'Product_Name': ['Mouse', 'Keyboard', 'Monitor', 'USB Cable', 'Charger'],
    'Price': [500, 700, 6000, 150, 800]
})

# Second DataFrame: Sales
df_sales = pd.DataFrame({
    'Product_ID': [101, 103, 106, 104],
    'Quantity': [10, 5, 7, 3],
    'Sale_Date': ['2025-03-01', '2025-03-02', '2025-03-03', '2025-03-04']
})

In [9]:
merged_inner = pd.merge(df_products, df_sales, on='Product_ID')
print("\n1. Inner Merge:\n", merged_inner)

1. Inner Merge:
    Product_ID Product_Name  Price  Quantity   Sale_Date
0         101        Mouse    500        10  2025-03-01
1         103      Monitor   6000         5  2025-03-02
2         104    USB Cable    150         3  2025-03-04

In [10]:
merged_left = pd.merge(df_products, df_sales, on='Product_ID', how='left')
print("\n2. Left Join:\n", merged_left)

2. Left Join:
    Product_ID Product_Name  Price  Quantity   Sale_Date
0         101        Mouse    500      10.0  2025-03-01
1         102     Keyboard    700       NaN         NaN
2         103      Monitor   6000       5.0  2025-03-02
3         104    USB Cable    150       3.0  2025-03-04
4         105      Charger    800       NaN         NaN

In [11]:
print("\n3. Left Join (again):\n", merged_left)

3. Left Join (again):
    Product_ID Product_Name  Price  Quantity   Sale_Date
0         101        Mouse    500      10.0  2025-03-01
1         102     Keyboard    700       NaN         NaN
2         103      Monitor   6000       5.0  2025-03-02
3         104    USB Cable    150       3.0  2025-03-04
4         105      Charger    800       NaN         NaN

In [12]:
df_extra = df_products.copy()
df_extra['Category'] = ['Electronics', 'Electronics', 'Electronics', 'Accessories', 'Accessories']
df_extra2 = df_sales.copy()
df_extra2['Category'] = ['Electronics', 'Electronics', 'Gaming', 'Accessories']

In [13]:
merged_multi = pd.merge(df_extra, df_extra2, on=['Product_ID', 'Category'], how='inner')
print("\n4. Merge on Multiple Columns:\n", merged_multi)

4. Merge on Multiple Columns:
    Product_ID Product_Name  Price     Category  Quantity   Sale_Date
0         101        Mouse    500  Electronics        10  2025-03-01
1         103      Monitor   6000  Electronics         5  2025-03-02
2         104    USB Cable    150  Accessories         3  2025-03-04

In [14]:
df1 = pd.DataFrame({'Country': ['India', 'USA', 'UK'], 'Value1': [10, 20, 30]})
df2 = pd.DataFrame({'Country': ['India', 'USA', 'Germany'], 'Value2': [100, 200, 300]})
merged_country = pd.merge(df1, df2, on='Country', how='inner')
print("\n5. Inner Join on Country:\n", merged_country)

5. Inner Join on Country:
   Country  Value1  Value2
0   India      10     100
1     USA      20     200

In [15]:
merged_outer = pd.merge(df_products, df_sales, on='Product_ID', how='outer')
print("\n6. Outer Join (All Rows):\n", merged_outer)

6. Outer Join (All Rows):
    Product_ID Product_Name   Price  Quantity   Sale_Date
0         101        Mouse   500.0      10.0  2025-03-01
1         102     Keyboard   700.0       NaN         NaN
2         103      Monitor  6000.0       5.0  2025-03-02
3         104    USB Cable   150.0       3.0  2025-03-04
4         105      Charger   800.0       NaN         NaN
5         106          NaN     NaN       7.0  2025-03-03

In [16]:
#17: Saving and Exporting Data
# Save to CSV (no index column)
merged_inner.to_csv('merged_data.csv', index=False)
print("CSV file saved: merged_data.csv")

CSV file saved: merged_data.csv

In [17]:
# Save to Excel (requires openpyxl for .xlsx)
merged_inner.to_excel('merged_data.xlsx', index=False)
print("Excel file saved: merged_data.xlsx")

Excel file saved: merged_data.xlsx

In [18]:
# Read the saved CSV
df_csv = pd.read_csv('merged_data.csv')
print("\nPreview from saved CSV:")
print(df_csv.head())

# Read the saved Excel
df_excel = pd.read_excel('merged_data.xlsx')
print("\nPreview from saved Excel:")
print(df_excel.head())

Preview from saved CSV:
   Product_ID Product_Name  Price  Quantity   Sale_Date
0         101        Mouse    500        10  2025-03-01
1         103      Monitor   6000         5  2025-03-02
2         104    USB Cable    150         3  2025-03-04

Preview from saved Excel:
   Product_ID Product_Name  Price  Quantity   Sale_Date
0         101        Mouse    500        10  2025-03-01
1         103      Monitor   6000         5  2025-03-02
2         104    USB Cable    150         3  2025-03-04